#+OPTIONS: :exports both
#+PROPERTY: header-args :exports both :eval never-export
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: H:4 num:nil toc:5
#+AUTHOR: Mehmet Tekman
#+options: timestamp:nil

#+TITLE: dropEst Pre-processing


***** Summary

      #+begin_src bash
      wc -l 4_output_matrix/matrices.{genes,cells}.tsv | head -2
      #+end_src

      29717 4_output_matrix/matrices.genes.tsv
       3291 4_output_matrix/matrices.cells.tsv

       That is a *lot* of cells detected, meaning the cell correction either didn't apply, or we're missing some paramaters

       #+begin_src bash
       tail -n+3 4_output_matrix/matrices.mtx | cut -d' ' -f 3 | sort -nk 1 | uniq -c
       #+end_src

       #+RESULTS:
       | 34892 |  1 |
       |  1694 |  2 |
       |   367 |  3 |
       |   128 |  4 |
       |    75 |  5 |
       |    65 |  6 |
       |    52 |  7 |
       |    58 |  8 |
       |    46 |  9 |
       |    22 | 10 |
       |    17 | 11 |
       |    10 | 12 |
       |     5 | 13 |
       |     6 | 14 |
       |     1 | 15 |

       #+begin_src R :results ouput
         tab <- readRDS('3_matrices_by_dropest/matrices.rds')
         print("Raw")
         print(dim(tab$cm_raw))
         print("Filtered")
         print(dim(tab$cm))
         print("Lib Sizes")
         print(summary(colSums(tab$cm)))
       #+end_src

       #+RESULTS:
       : [Raw]          47742 56028
       : [Filtered]     29717  3291
       : [Lib Sizes]
       : Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
       : 104.0   126.0   141.0   152.5   165.0   951.0


       Minimum library size of a filtered cell is 100, and max is ~ 1000. Something doesn't feel right for them to be this low.


***** Run2: Expect 600 cells

      Okay let's run this again, this time specifying that we want no more than 600 cells. I will be surprised if this changes anything.


       #+begin_src bash
         mkdir 3_matrices_by_dropest_600;
         comm=$(echo dropest -P -u -V -C 600 -w -o 3_matrices_by_dropest_600/matrices\
             -r 1_processed_by_droptag/aMI_*_RP{13,14,15,16,1,2,4}_R2.fastq.gz.tagged.params.gz\
             -c tools/dropEst/configs/cel_seq2.xml\
             2_kallisto_bams_70_05_overhang/aMI_*_RP{13,14,15,16,1,2,4}_R2.fastq.gz.tagged.2.fastq.gz/pseudoalignments.bam\
                    | sed 's|-r |-r "|' | sed 's| -c |" -c |')
         echo $comm
         eval $comm

       #+end_src

      #+begin_src bash :results output
      wc -l /extra/bismark/3_matrices_by_dropest_600/matrices.{genes,cells}.tsv | head -2
      #+end_src

      #+RESULTS:
      :  19028 /extra/bismark/3_matrices_by_dropest_600/matrices.genes.tsv
      :    600 /extra/bismark/3_matrices_by_dropest_600/matrices.cells.tsv


      Nice, this time it looks like it counted cells properly. Let's see the level of merging:

       #+begin_src bash
       tail -n+3 /extra/bismark/3_matrices_by_dropest_600/matrices.mtx | cut -d' ' -f 3 | sort -nk 1 | uniq -c
       #+end_src

       #+RESULTS:
       | 99723 |  1 |
       |  5837 |  2 |
       |  1421 |  3 |
       |   585 |  4 |
       |   332 |  5 |
       |   217 |  6 |
       |   157 |  7 |
       |   121 |  8 |
       |   107 |  9 |
       |    93 | 10 |
       |    95 | 11 |
       |    92 | 12 |
       |    79 | 13 |
       |    66 | 14 |
       |    51 | 15 |
       |    32 | 16 |
       |    25 | 17 |
       |     5 | 18 |
       |     8 | 19 |
       |     3 | 20 |
       |     1 | 22 |

       Spread of detectability has not changed significantly, but there is a slight upshift in expression as expected, so cell barcodes were likely merged.

       #+begin_src R :results ouput
         tab <- readRDS('/extra/bismark/3_matrices_by_dropest_600/matrices.rds')
         library(Matrix)
         print("Raw")
         print(dim(tab$cm_raw))
         print("Filtered")
         print(dim(tab$cm))
         print("Lib Sizes")
         print(summary(colSums(tab$cm)))
       #+end_src

       #+RESULTS:
       : [Raw]          47742 56028
       : [Filtered]     19028   600
       : [Lib Sizes]
       :  Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
       : 158.0   186.0   204.0   218.4   234.2   951.0

       Max has not changed, but overall upshift of all other values. Still, this is very low quality and I don't know why.

       #+begin_src R
       head(colSums(tab$cm)))
       #+end_src

       #+RESULTS:
       : GCGTGTAG GTTTGAAC TGGTGTTG GTGTGGAC TGTATTTG TTGTGTAT
       : 177      180      180      185      186      187

       Ah... it appears that the cell barcodes here are 8bp long, and the 6bp used for CELSeq2. I believe the original CELSeq used 8bp, and this could be another bug in DropEst. If we explore the config file =dropEst/configs/cel_seq2.xml=:

       #+begin_src xml
         <config>
             <!-- droptag -->
             <TagsSearch>
                 <protocol>cel_seq2</protocol>
                 <MultipleBarcodeSearch>
                     <barcode_starts>0</barcode_starts>
                     <barcode_lengths>8</barcode_lengths>
                     <umi_start>8</umi_start>
                     <umi_length>4</umi_length>
                 </MultipleBarcodeSearch>

                 <Processing>
                     <min_align_length>10</min_align_length>
                     <reads_per_out_file>10000000</reads_per_out_file>
                 </Processing>
             </TagsSearch>

             <!-- dropest -->
             <Estimation>
                 <Merge>
                     <max_cb_merge_edit_distance>4</max_cb_merge_edit_distance>
                     <max_umi_merge_edit_distance>1</max_umi_merge_edit_distance>
                     <min_genes_after_merge>100</min_genes_after_merge>
                     <min_genes_before_merge>20</min_genes_before_merge>
                 </Merge>
             </Estimation>
         </config>
       #+end_src

       Well, we can see that it was definitely using the old protocol.
       I guess I will change this file, write an angry bug report to the DropEst team, and re-run with CELSeq2 params


** Reconfigure XML

   UMI is first 6, then CB as last 6, and then the sequence.

   #+begin_src xml :file tools/dropest/configs/celseq2_MPI.xml
     <config>
         <!-- droptag -->
         <TagsSearch>
             <protocol>cel_seq2</protocol>
             <MultipleBarcodeSearch>
                 <umi_start>0</umi_start>
                 <umi_length>6</umi_length>
                 <barcode_starts>6</barcode_starts>
                 <barcode_lengths>6</barcode_lengths>
             </MultipleBarcodeSearch>

             <Processing>
                 <min_align_length>10</min_align_length>
                 <reads_per_out_file>10000000</reads_per_out_file>
             </Processing>
         </TagsSearch>

         <!-- dropest -->
         <Estimation>
             <Merge>
                 <max_cb_merge_edit_distance>4</max_cb_merge_edit_distance>
                 <max_umi_merge_edit_distance>1</max_umi_merge_edit_distance>
                 <min_genes_after_merge>100</min_genes_after_merge>
                 <min_genes_before_merge>20</min_genes_before_merge>
             </Merge>
         </Estimation>
     </config>

   #+end_src

   Now let's move all the other files into a new directory. The current project tree is thus:

   #+begin_src bash :results output
   tree /extra/bismark/ -I tools -d -L 3
   #+end_src

   #+RESULTS:
   #+begin_example
   /extra/bismark/
   ├── 0_history_data
   ├── initial
   │   ├── part1
   │   │   ├── 0_history_data
   │   │   ├── 1_processed_by_droptag
   │   │   ├── 2_kallisto_bams_110_30
   │   │   ├── 2_kallisto_bams_70_05
   │   │   ├── 2_kallisto_bams_70_05_overhang
   │   │   ├── 2_kallisto_bams_82_10
   │   │   ├── 2_kallisto_bams_82_25
   │   │   ├── 3_matrices_by_dropest
   │   │   ├── 3_matrices_by_dropest_70_05
   │   │   ├── 3_matrices_by_dropest_70_05_overhang
   │   │   └── 4_output_matrix
   │   └── part2
   │       ├── 0_history_data_2
   │       ├── 1_processed_by_droptag
   │       ├── 2_kallisto_bams
   │       ├── 2_kallisto_bams_70_05_overhang
   │       ├── 3_matrices_by_dropest
   │       ├── 3_matrices_by_dropest_600
   │       └── 4_output_matrix
   ├── second
   └── transcript

   24 directories
   #+end_example

   We will perform the analysis in the =second= directory.

   
**** DropTag
     
     Here we instead use the =celseq2_MPI.xml= file we generated before
     
     It would be nice to use =xargs= or =parallel= here, but we have no idea if droptag is threadsafe, so sequential processing is better.


     #+begin_src bash
       mkdir -p second/1_processed_by_droptag;

       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_EPZ_E14_RP1_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_EPZ_E14_RP2_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_EPZ_E14_RP3_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_EPZ_E14_RP4_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_DMSO_E14_RP13_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_DMSO_E14_RP14_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_DMSO_E14_RP15_R{1,2}.fastq.gz
       droptag -c tools/dropEst/configs/celseq2_MPI.xml -s -S 0_history_data/aMI_DMSO_E14_RP16_R{1,2}.fastq.gz

       mv *.fastq.gz second/1_processed_by_droptag;
     #+end_src

     
     A quick peek at the dataset confirms it has demultiplexed the dataset correctly

     #+begin_src bash
       zcat second/1_processed_by_droptag/aMI_DMSO_E14_RP13_R2.fastq.gz.tagged.params.gz | cut -d ' ' -f 2,3 | pv | sort | uniq -c | sort -rnk 1 | head -10
     #+end_src

     #+RESULTS:
     | 21407 | ACGACT | CACTTG |
     |  9120 | AAACGT | ACTAAA |
     |  6255 | AATGAG | ATGGAA |
     |  5274 | ATGGCG | TGGAAT |
     |  3314 | AATGAG | ACGGAA |
     |  2842 | AAACGT | ACTGAA |
     |  2683 | AAAAAA | AAAAAA |
     |  2309 | TTTTTT | TTTTTT |
     |  2279 | CAGAAG | GGGGGG |
     |  2054 | GACAGA | GGGGGG |

     So good, we have barcodes and umis. 
     
     + Note :: We still have the problem of not being able to feed in a whitelist of accepted barcodes to help erroneous barcodes merge, and instead relying on DropEst to make this estimate for us (which could be wrong!).


******* L 70 and S 5 with single overhang

        #+begin_src bash
          for fastq in second/1_processed_by_droptag/aMI_*.fastq.gz.tagged.2.fastq.gz; do
              outname=second/2_kallisto_bams_70_05_overhang/$(basename $fastq)/;
              mkdir -p $outname;
              kallisto quant --pseudobam --single --single-overhang -i transcript/kallisto.index -o $outname -l 70 -s 5 $fastq;
          done

          grep "p_" second/2_kallisto_bams_70_05_overhang/*/*.json -R\
              | cut -d: -f 2,3 | sed ':a;N;$!ba;s/\n//g' | sed 's/"p_pseudo/\n"p_pseudo/g'

        #+end_src

        #+RESULTS:
        : "p_pseudoaligned": 60.2,        "p_unique": 25.0,
        : "p_pseudoaligned": 59.3,        "p_unique": 24.5,
        : "p_pseudoaligned": 59.6,        "p_unique": 24.7,
        : "p_pseudoaligned": 54.1,        "p_unique": 22.2,
        : "p_pseudoaligned": 60.4,        "p_unique": 24.5,
        : "p_pseudoaligned": 59.7,        "p_unique": 24.3,
        : "p_pseudoaligned": 59.4,        "p_unique": 23.6,


